<?php

// 1. Объявить две целочисленные переменные $a и $b и задать им произвольные начальные значения. Затем написать скрипт, который работает по следующему принципу:

//     если $a и $b положительные, вывести их разность;
//     если $а и $b отрицательные, вывести их произведение;
//     если $а и $b разных знаков, вывести их сумму;

// ноль можно считать положительным числом.

// $a = -2;
// $b = 44;

// if ($a > 0 && $b > 0) {
//     echo $a - $b;
// } elseif ($a < 0 && $b < 0) {
//     echo $a * $b;
// } elseif (($a < 0 && $b > 0) || ($a > 0 && $b < 0)) {
//     echo $a + $b;
// } else {
//     echo "Ошибка!"
// }

// 2. Присвоить переменной $а значение в промежутке [0..15]. С помощью оператора switch организовать вывод чисел от $a до 15.

$c = 